app/controllers/eyeshadows_controller.rb

SELECT "eyeshadows".* FROM "eyeshadows"
---
  def index
    @eyeshadows = Eyeshadow.all

SELECT  "eyeshadows".* FROM "eyeshadows" WHERE "eyeshadows"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @eyeshadow = Eyeshadow.find(params[:id])