app/controllers/lipsticks_controller.rb

SELECT "lipsticks".* FROM "lipsticks"
---
  def index
    @lipsticks = Lipstick.all

SELECT  "lipsticks".* FROM "lipsticks" WHERE "lipsticks"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
---
  def show
    @lipstick = Lipstick.find(params[:id])