app/controllers/mascaras_controller.rb

  def index
    @mascaras = Mascara.all
---
SELECT "mascaras".* FROM "mascaras"

  def show
    @mascara = Mascara.find(params[:id])
---
SELECT  "mascaras".* FROM "mascaras" WHERE "mascaras"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]