app/controllers/reviews_controller.rb

  def new
    if params[:eyeshadow_id].present?
       @eyeshadow = Eyeshadow.find(params[:eyeshadow_id])
---
SELECT  "eyeshadows".* FROM "eyeshadows" WHERE "eyeshadows"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

 def create
   if params[:eyeshadow_id].present?
      @eyeshadow = Eyeshadow.find(params[:eyeshadow_id])
      @user = current_user
      @review = Review.new(params_strong)
      @review.eyeshadow = @eyeshadow
      @review.user = @user
      if @review.save
          flash[:notice] = "Review added successfully"
          redirect_to eyeshadow_path(@eyeshadow)
          # redirect_to controller: 'eyeshadow', action: 'show', id: params[:eyeshadow_id]
      else
          flash[:notice] = @review.errors.full_messages.to_sentence
          @reviews = @eyeshadow.reviews
          @rating_collection = Review::RATINGS
          render '/eyeshadows/show'
        end
    elsif params[:lipstick_id].present?
      @lipstick = Lipstick.find(params[:lipstick_id])
---
SELECT  "eyeshadows".* FROM "eyeshadows" WHERE "eyeshadows"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "reviews" ("rating", "body", "user_id", "eyeshadow_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 5], ["body", "foobar test"], ["user_id", 1], ["eyeshadow_id", 6], ["created_at", 2017-02-07 19:26:53 UTC], ["updated_at", 2017-02-07 19:26:53 UTC]]
SELECT  "lipsticks".* FROM "lipsticks" WHERE "lipsticks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

        render '/lipsticks/show'
      end
    else
      @mascara = Mascara.find(params[:mascara_id])
---
SELECT  "mascaras".* FROM "mascaras" WHERE "mascaras"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]